/*
脚本：超级主线任务
作者：小米冒险岛、小米
时间：2019.11.5

*/
var 任务名称 = "副本眼镜";
var 主线任务 = new Array(
//奖励的和奖励数量必须一致，需要材料和材料数量必须一致，否则会出错！
[[10]/*0等级*/,[1022228,5,5,5,5,0,0,5,5,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[4170001,4170009,4170002,4170005,4310153]/*3需要材料*/,[10,10,10,10,10]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k",0]/*6简介1,简介2*/],
[[50]/*0等级*/,[1022224,10,10,10,10,0,0,10,10,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1022228,4170001,4170009,4170002,4170005,4310153]/*3需要材料*/,[1,20,20,20,20,20]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k",0]/*6简介1,简介2*/],
[[75]/*0等级*/,[1022225,20,20,20,20,0,0,20,20,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1022224,4170001,4170009,4170002,4170005,4310153]/*3需要材料*/,[1,40,40,40,40,40]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k",0]/*6简介1,简介2*/],
[[120]/*0等级*/,[1022226,30,30,30,30,0,0,30,30,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1022225,4170001,4170009,4170002,4170005,4310153]/*3需要材料*/,[1,80,80,80,80,80]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k",0]/*6简介1,简介2*/]



);


var 兔子1 = "#fEffect/CharacterEff/1082565/0/0#";
var 兔子2 = "#fEffect/CharacterEff/1082565/2/0#";
var 兔子3 = "#fEffect/CharacterEff/1082565/4/0#";
var 表情高兴 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/2#";
var 小金币 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 点券图标 = "#fUI/CashShop/CashItem/0#";
var sels;
var status = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {
		角色等级 = cm.getPlayer().getLevel();
		
		任务等级 = cm.getPlayer().getBossLog(任务名称,1);
		
        总进度 = 任务等级*5;
        var msg = "";	
        msg += "             #e#d"+表情高兴+" 副本眼镜升级 "+表情高兴+"\r\n\r\n#n";
		msg += "#k这里可以用各种副本奖励兑换眼镜！\r\n#d";
        msg += "当前等级：lev."+角色等级+"\r\n#d";
        msg += "任务进度：#B"+总进度+"[%]# 任务["+任务等级+"]\r\n#d";
        		
		for (var i = 0; i < 主线任务.length; i++) {
			
			       if (角色等级 >= 主线任务[i][0] && 任务等级 == i) {
            msg += "    #e #L"+i+"#"+兔子3+"#d"+任务名称+""+(i+1)+"(lev."+主线任务[i][0][0]+")[#r可开始#d]"+兔子3+"#l\r\n\r\n";
			
			} else if (任务等级 > i ) {
			//msg += "         #L"+i+"#"+兔子3+"#k主线任务"+(i+1)+"(lev."+主线任务[i][0][0]+")[已完成#d]"+兔子3+"#l\r\n";
			msg += "    #e  "+兔子3+"#k"+任务名称+""+(i+1)+"(lev."+主线任务[i][0][0]+")[已完成#d]"+兔子3+"\r\n\r\n";
			
			} else {
			msg += "   #e #L"+i+"#"+兔子2+"#d"+任务名称+""+(i+1)+"(lev."+主线任务[i][0][0]+")[#b待开始#d]"+兔子2+"#l\r\n\r\n";
			
			}

        }

		
        cm.sendSimple("" + msg + "");
    } else if (status == 1) {
		检测材料 = false;
		任务 = selection;
		if (任务等级 > 任务) {
		cm.sendOk("已经完成的任务！");	
        cm.dispose();
        return;		
		}
	


        sels = selection;
        var msg = "";		
            msg += "                 #e#d当前为"+任务名称+"["+(任务+1)+"]#n\r\n\r\n"
            文字说明 = 主线任务[任务][6][0];
			msg += ""+文字说明+"\r\n"
			msg += "#b升级为：\r\n"
			
			msg += "#d#v"+主线任务[任务][1][0]+"##t"+主线任务[任务][1][0]+"#\r\n"
			if (主线任务[任务][1][1] > 0){
			msg += "#d力量:"+主线任务[任务][1][1]+"\r\n"
			} if (主线任务[任务][1][2] > 0){
			msg += "#d敏捷:"+主线任务[任务][1][2]+"\r\n"
			} if (主线任务[任务][1][3] > 0){
			msg += "#d智力:"+主线任务[任务][1][3]+"\r\n"
			} if (主线任务[任务][1][4] > 0){
			msg += "#d运气:"+主线任务[任务][1][4]+"\r\n"
			} if (主线任务[任务][1][5] > 0){
			msg += "#dHP:"+主线任务[任务][1][5]+"\r\n"
			} if (主线任务[任务][1][6] > 0){
			msg += "#dMP:"+主线任务[任务][1][6]+"\r\n"
			} if (主线任务[任务][1][7] > 0){
			msg += "#d物攻:"+主线任务[任务][1][7]+"\r\n"
			} if (主线任务[任务][1][8] > 0){
			msg += "#d魔攻:"+主线任务[任务][1][8]+"\r\n"
			} if (主线任务[任务][1][9] > 0){
			msg += "#d物防:"+主线任务[任务][1][9]+"\r\n"
			} if (主线任务[任务][1][10] > 0){
			msg += "#d魔防:"+主线任务[任务][1][10]+"\r\n"
			} if (主线任务[任务][1][11] > 0){
			msg += "#d回避:"+主线任务[任务][1][11]+"\r\n"
			} if (主线任务[任务][1][12] > 0){
			msg += "#d命中:"+主线任务[任务][1][12]+"\r\n"
			} if (主线任务[任务][1][13] > 0){
			msg += "#d跳跃:"+主线任务[任务][1][13]+"\r\n"
			} if (主线任务[任务][1][14] > 0){
			msg += "#d速度:"+主线任务[任务][1][14]+"\r\n"
			}
				
            点卷 = 主线任务[任务][5][0];
			金币 = 主线任务[任务][5][1];
			// if (点卷 >0){
			// msg += ""+点券图标+"点卷:"+点卷+"\r\n"
			// }
			// if (金币 >0){
			// msg += ""+小金币+"金币:"+金币+"\r\n"
			// }	
				
			msg += "#b需要收集：\r\n"
		for (var i = 0; i < 主线任务[任务][3].length; i++) {			
            msg += "#d#i"+主线任务[任务][3][i]+":##z"+主线任务[任务][3][i]+"# [#b#c"+主线任务[任务][3][i]+"##d/#r"+主线任务[任务][4][i]+"#d]\r\n"
			if (!cm.haveItem(主线任务[任务][3][i],主线任务[任务][4][i])){
			检测材料 = true;
			}	
		}					
        cm.sendYesNo(msg);
    } else if (status == 2) {
		
		if (角色等级 < 主线任务[任务][0][0]) {
		cm.sendOk("请不要越级做勋章哦!年轻人，还是脚踏实地吧！");	
        cm.dispose();
        return;		
		}
		if (任务等级 < 任务){
		cm.sendOk("请先完成"+任务名称   +"["+(任务等级+1)+"]！不要想一步登天哦！");	
        cm.dispose();
        return;			
		}
		
		if (检测材料) {
		cm.sendOk("很抱歉！材料不足无法让您通过！\r\n为了证明你能力，请把需要的材料带来！");	
        cm.dispose();
        return;			
		}
		

		//cm.playerMessage(5, "测试信息222");
        if (cm.getInventory(1).isFull(1)){
		cm.sendOk("背包空间不足哦！");	
        cm.dispose();
        return;			
		}
		
		for (var i = 0; i < 主线任务[任务][3].length; i++) {			
            cm.gainItem(主线任务[任务][3][i],-主线任务[任务][4][i]);				
		}
		// for (var i = 0; i < 主线任务[任务][1].length; i++) {			
            // cm.gainItem(主线任务[任务][1][i],主线任务[任务][2][i]);				
		// } 
        cm.gainItem(主线任务[任务][1][0],主线任务[任务][1][1],主线任务[任务][1][2],主线任务[任务][1][3],主线任务[任务][1][4],主线任务[任务][1][5],主线任务[任务][1][6],主线任务[任务][1][7],主线任务[任务][1][8],主线任务[任务][1][9],主线任务[任务][1][10],主线任务[任务][1][11],主线任务[任务][1][12],主线任务[任务][1][13],主线任务[任务][1][14] );		
		// if (点卷 >0){
        // cm.gainNX(+点卷);
		// }
		// if (金币 >0){
        // cm.gainMeso(+金币);	
        // }		
        cm.getPlayer().setBossLog(任务名称,1,1);
		cm.worldMessage(2,"【勋章制作】" + " : " + "["+cm.getName()+"]完成了"+任务名称+"["+cm.getPlayer().getBossLog(任务名称,1)+"] 获得[独眼巨人之眼全属性+"+主线任务[任务][1][1]+"]"); //蓝底透明
		cm.sendOk("太好了，你有通关自己的努力完成了一次主线任务！");	
        cm.dispose();
        return;	

    } else {
        cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}