/*
脚本：超级主线任务
作者：小米冒险岛、小米
时间：2019.11.5

*/
var 任务名称 = " 主 线 任 务 ";
var 主线任务 = new Array(
//奖励的和奖励数量必须一致，需要材料和材料数量必须一致，否则会出错！
[[10]/*0等级*/,[1003242]/*1奖励*/,[1]/*2奖励数量*/,[4000019,4000000,4000016]/*3需要材料*/,[300,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度。集齐5套宝石套装可以提炼成全属性+30-300的外星人装备",0]/*蜗牛壳*/],

[[20]/*0等级*/,[1052357]/*1奖励*/,[1]/*2奖励数量*/,[4000037,4000042,4000035]/*3需要材料*/,[300,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度。集齐5套宝石套装可以提炼成全属性+30-300的外星人装备",0]/*蝙蝠翅膀，蓝水灵珠子，桌布*/],

[[30]/*0等级*/,[1102294]/*1奖励*/,[1]/*2奖励数量*/,[4000024,4000014,4000030]/*3需要材料*/,[300,300,100]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度。集齐5套宝石套装可以提炼成全属性+30-300的外星人装备",0]/*火野猪牙，龙头骨，龙皮*/],

[[40]/*0等级*/,[1072521]/*1奖励*/,[1]/*2奖励数量*/,[4000008,4000015,4000007]/*3需要材料*/,[300,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度。集齐5套宝石套装可以提炼成全属性+30-300的外星人装备",0]/*道符，次蘑菇盖，火毒尾巴*/],

[[50]/*0等级*/,[1082314]/*1奖励*/,[1]/*2奖励数量*/,[4000177,4000025,4001006]/*3需要材料*/,[300,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度。集齐5套宝石套装可以提炼成全属性+30-300的外星人装备",0]/*混合石头，黑石头，火焰羽毛*/],



[[60]/*0等级*/,[1122174]/*1奖励*/,[1]/*2奖励数量*/,[4000233,4000234,4000232]/*3需要材料*/,[388,388,388]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*火冰黑*/],

[[70]/*0等级*/,[1082401]/*1奖励*/,[1]/*2奖励数量*/,[4000401,4000407,4170014]/*3需要材料*/,[300,300,10]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*铜人副本蛋*/],

[[80]/*0等级*/,[1072618]/*1奖励*/,[1]/*2奖励数量*/,[4000402,4000405,4170002]/*3需要材料*/,[300,300,10]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*银人副本蛋*/],

[[90]/*0等级*/,[1062148]/*1奖励*/,[1]/*2奖励数量*/,[4000406,4000404,4170005]/*3需要材料*/,[300,300,10]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*金人副本蛋*/],

[[100]/*0等级*/,[1042231]/*1奖励*/,[1]/*2奖励数量*/,[4000069,4000082,4002002]/*3需要材料*/,[888,200,30]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*6金牙,邮票*/],

[[110]/*0等级*/,[1032121]/*1奖励*/,[1]/*2奖励数量*/,[4000152,4000151,4001084]/*3需要材料*/,[200,200,1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k听说闹钟的左右门神有掉落我需要的材料",0]/*闹钟门神 闹钟象征*/],




[[120]/*0等级*/,[1132110]/*1奖励*/,[1]/*2奖励数量*/,[4000403,4000398,4001083]/*3需要材料*/,[300,300,1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度，任务材料在藏经阁附近",0]/*木鱼眼 佛珠 扎昆*/],

[[130]/*0等级*/,[1102322]/*1奖励*/,[1]/*2奖励数量*/,[4000397,4000396,4000393]/*3需要材料*/,[300,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度，任务材料在藏经阁附近",0]/*飞贼*/],

[[140]/*0等级*/,[1082391]/*1奖励*/,[1]/*2奖励数量*/,[4000271,4000272,4001266]/*3需要材料*/,[300,300,1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*蛋怪*/],

[[150]/*0等级*/,[1072610]/*1奖励*/,[1]/*2奖励数量*/,[4000273,4000274]/*3需要材料*/,[588,588]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#我想要龙的骨头，快去龙之巢穴入口帮我收集吧",0]/*古龙*/],

[[160]/*0等级*/,[1052405]/*1奖励*/,[1]/*2奖励数量*/,[4031165]/*3需要材料*/,[100]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k我需要魔女草的叶子100个，听说在废弃的下水道有这种草",0]/*废弃魔女草*/],

[[170]/*0等级*/,[1003364]/*1奖励*/,[1]/*2奖励数量*/,[4031150]/*3需要材料*/,[100]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k我需要植物样品100个，进行实验，听说在魔法密林的地上就有生长这类植物",0]/*魔法密林药剂*/],




[[180]/*0等级*/,[1132161]/*1奖励*/,[1]/*2奖励数量*/,[4031157,4031158,4031159]/*3需要材料*/,[1,1,1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k帮助射手村亚华找回冒险岛古书就可以获得主线任务需要的材料",0]/*射手任务*/],

[[190]/*0等级*/,[1102467]/*1奖励*/,[1]/*2奖励数量*/,[4031807]/*3需要材料*/,[1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k射手村明明女士生病了，需要一碗参鸡汤进行滋补，快去寻找吧",0]/*射手明明女士的鸡汤*/],

[[200]/*0等级*/,[1082438]/*1奖励*/,[1]/*2奖励数量*/,[4031808]/*3需要材料*/,[1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k废弃的犀利帅小伙 伊卡路斯 竟然尿床了 急需一个羊毛毯子，快去废弃找他吧",0]/*废弃鸟床了*/],

[[210]/*0等级*/,[1072672]/*1奖励*/,[1]/*2奖励数量*/,[4031290]/*3需要材料*/,[1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k上海的摄影师丢失了三脚架，快去上海帮助他找回三脚架",0]/*上海 摄影师*/],

[[220]/*0等级*/,[1052467]/*1奖励*/,[1]/*2奖励数量*/,[1102053]/*3需要材料*/,[1]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k废弃的一个陌生女人拜托我帮他寻找一件破披风，快去废弃找一个不认识的女人接取任务",0]/*废弃紧急医院破披风*/],

[[230]/*0等级*/,[1003561]/*1奖励*/,[1]/*2奖励数量*/,[4031258,4031231]/*3需要材料*/,[100,100]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#马上过年了 我想要一些野菊花和艾草，装扮一束鲜花 送给心爱的女人",0]/*野菊花 艾草 童话村*/],

[[240]/*0等级*/,[2614001]/*1奖励*/,[1]/*2奖励数量*/,[4000154]/*3需要材料*/,[3888]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度",0]/*6简介1,简介2*/],

[[250]/*0等级*/,[4001190]/*1奖励*/,[1]/*2奖励数量*/,[4001094]/*3需要材料*/,[10]/*4材料数量*/,[0,0]/*5点卷,金币*/,
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度？",0]/*黑球*/],

//////////////////////////////////////////////////////////////////
[[250],[4001190],[1],[4001126],[1000],[0,0],           //等级，奖励，数量，需要的材料，需要材料的数量，金币点卷
["#k搜集材料通过主线任务、主线任务越高获得的奖励越多，但是主线任务存在一定的难度？",0]/*黑球*/]










);


var 兔子1 = "#fEffect/CharacterEff/1082565/0/0#";
var 兔子2 = "#fEffect/CharacterEff/1082565/2/0#";
var 兔子3 = "#fEffect/CharacterEff/1082565/4/0#";
var 表情高兴 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/2#";
var 小金币 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 点券图标 = "#fUI/CashShop/CashItem/0#";
var sels;
var status = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {
		角色等级 = cm.getPlayer().getLevel();
		
		任务等级 = cm.getPlayer().getBossLog(任务名称,1);
		
        总进度 = 任务等级*1;
        var msg = "";	
        msg += "           #e#d"+表情高兴+" 企 鹅 大 陆 主 线 任 务 "+表情高兴+"\r\n\r\n#n";
		msg += "#k完成主线任务，可以获得超多福利，完成的越多奖励越丰富！\r\n#d";
        msg += "当前等级：Lve."+角色等级+"\r\n#d";
        msg += "任务进度：#B"+总进度+"[%]# 任务["+任务等级+"]\r\n#d";
        		
		for (var i = 0; i < 主线任务.length; i++) {
			
			       if (角色等级 >= 主线任务[i][0] && 任务等级 == i) {
            msg += "         #L"+i+"#"+兔子3+"#d"+任务名称+""+(i+1)+" (#e#dLve."+主线任务[i][0][0]+"#n)[#r可开始#d]"+兔子3+"#l\r\n";
			
			} else if (任务等级 > i ) {
			//msg += "         #L"+i+"#"+兔子3+"#k主线任务"+(i+1)+"(lev."+主线任务[i][0][0]+")[已完成#d]"+兔子3+"#l\r\n";
			//msg += "           "+兔子3+"#k"+任务名称+""+(i+1)+" (#e#dLve."+主线任务[i][0][0]+"#n)[已完成#d]"+兔子3+"\r\n";
			
			} else {
			msg += "         #L"+i+"#"+兔子2+"#d"+任务名称+""+(i+1)+" (#e#dLve."+主线任务[i][0][0]+"#n)[#b待开始#d]"+兔子2+"#l\r\n";
			
			}

        }

		
        // cm.sendSimple("" + msg + "");
		cm.sendSimple("           #e#d"+表情高兴+" 主 线 任 务 正 在 更 新 "+表情高兴+"\r\n\r\n#n");
    } else if (status == 1) {
		// change
		return;
		检测材料 = false;
		任务 = selection;
		if (任务等级 > 任务) {
		cm.sendOk("已经完成的任务！");	
        cm.dispose();
        return;		
		}
	


        sels = selection;
        var msg = "";		
            msg += "                 #e#d当前为"+任务名称+"["+(任务+1)+"]#n\r\n\r\n"
            文字说明 = 主线任务[任务][6][0];
			msg += ""+文字说明+"\r\n"
			msg += "#b奖励为：\r\n"
			
			msg += "#d#v"+主线任务[任务][1][0]+"##t"+主线任务[任务][1][0]+"#\r\n"
			if (主线任务[任务][1][1] > 0){
			msg += "#d力量:"+主线任务[任务][1][1]+"\r\n"
			} if (主线任务[任务][1][2] > 0){
			msg += "#d敏捷:"+主线任务[任务][1][2]+"\r\n"
			} if (主线任务[任务][1][3] > 0){
			msg += "#d智力:"+主线任务[任务][1][3]+"\r\n"
			} if (主线任务[任务][1][4] > 0){
			msg += "#d运气:"+主线任务[任务][1][4]+"\r\n"
			} if (主线任务[任务][1][5] > 0){
			msg += "#dHP:"+主线任务[任务][1][5]+"\r\n"
			} if (主线任务[任务][1][6] > 0){
			msg += "#dMP:"+主线任务[任务][1][6]+"\r\n"
			} if (主线任务[任务][1][7] > 0){
			msg += "#d物攻:"+主线任务[任务][1][7]+"\r\n"
			} if (主线任务[任务][1][8] > 0){
			msg += "#d魔攻:"+主线任务[任务][1][8]+"\r\n"
			} if (主线任务[任务][1][9] > 0){
			msg += "#d物防:"+主线任务[任务][1][9]+"\r\n"
			} if (主线任务[任务][1][10] > 0){
			msg += "#d魔防:"+主线任务[任务][1][10]+"\r\n"
			} if (主线任务[任务][1][11] > 0){
			msg += "#d回避:"+主线任务[任务][1][11]+"\r\n"
			} if (主线任务[任务][1][12] > 0){
			msg += "#d命中:"+主线任务[任务][1][12]+"\r\n"
			} if (主线任务[任务][1][13] > 0){
			msg += "#d跳跃:"+主线任务[任务][1][13]+"\r\n"
			} if (主线任务[任务][1][14] > 0){
			msg += "#d速度:"+主线任务[任务][1][14]+"\r\n"
			}
				
            点卷 = 主线任务[任务][5][0];
			金币 = 主线任务[任务][5][1];
			// if (点卷 >0){
			// msg += ""+点券图标+"点卷:"+点卷+"\r\n"
			// }
			// if (金币 >0){
			// msg += ""+小金币+"金币:"+金币+"\r\n"
			// }	
				
			msg += "#b\r\n需要收集：\r\n"
		for (var i = 0; i < 主线任务[任务][3].length; i++) {			
            msg += "#d#i"+主线任务[任务][3][i]+":##z"+主线任务[任务][3][i]+"# [#b#c"+主线任务[任务][3][i]+"##d/#r"+主线任务[任务][4][i]+"#d]\r\n"
			if (!cm.haveItem(主线任务[任务][3][i],主线任务[任务][4][i])){
			检测材料 = true;
			}	
		}					
        cm.sendYesNo(msg);
    } else if (status == 2) {
		
		if (角色等级 < 主线任务[任务][0][0]) {
		cm.sendOk("请不要越级做任务哦!年轻人，还是脚踏实地吧！");	
        cm.dispose();
        return;		
		}
		if (任务等级 < 任务){
		cm.sendOk("请先完成"+任务名称   +"["+(任务等级+1)+"]！不要想一步登天哦！");	
        cm.dispose();
        return;			
		}
		
		if (检测材料) {
		cm.sendOk("很抱歉！材料不足无法让您通过！\r\n为了证明你能力，请把需要的材料带来！");	
        cm.dispose();
        return;			
		}
		

		//cm.playerMessage(5, "测试信息222");
        if (cm.getInventory(1).isFull(1)){
		cm.sendOk("背包空间不足哦！");	
        cm.dispose();
        return;			
		}
		
		for (var i = 0; i < 主线任务[任务][3].length; i++) {			
            cm.gainItem(主线任务[任务][3][i],-主线任务[任务][4][i]);				
		}
		 for (var i = 0; i < 主线任务[任务][1].length; i++) {			
            cm.gainItem(主线任务[任务][1][i],主线任务[任务][2][i]);				
		 } 
        //cm.gainItem(主线任务[任务][1][0],主线任务[任务][1][1],主线任务[任务][1][2],主线任务[任务][1][3],主线任务[任务][1][4],主线任务[任务][1][5],主线任务[任务][1][6],主线任务[任务][1][7],主线任务[任务][1][8],主线任务[任务][1][9],主线任务[任务][1][10],主线任务[任务][1][11],主线任务[任务][1][12],主线任务[任务][1][13],主线任务[任务][1][14] );		
		// if (点卷 >0){
        // cm.gainNX(+点卷);
		// }
		// if (金币 >0){
        // cm.gainMeso(+金币);	
        // }		
        cm.getPlayer().setBossLog(任务名称,1,1);
		cm.worldMessage(2,"【主线任务】" + " : " + "["+cm.getName()+"]完成了"+任务名称+"["+cm.getPlayer().getBossLog(任务名称,1)+"] 获得主线任务奖励，又变强了一步，继续加油。"); //蓝底透明
		cm.sendOk("太好了，你有通关自己的努力完成了一次主线任务！");	
        cm.dispose();
        return;	

    } else {
        cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}