status = -1;
//刚刚找你 你不在 所以我就给你写这套脚本出来了 我给你解说下 
var itemList = new Array(//首先我们要接触到的 就是 Array函数系列的运用
			/*Array(1032027,800, 1, 1), //黑水晶耳环
			如上面一排格式大概就是这样   Array(物品ID,概率,数量,播报),//物品名字
			大概格式就是这样然后我给你解说下 概率和播报这两个
			概率这个值是怎么算高或者怎么算低呢？？ 就是全部所有的物品的暴率都加起来然后用这个数除以总暴率就是 这件物品的暴率了
			播报很简单 0就是抽中奖品后不发公告内容 1就是中奖之后要发一条喇叭说 谁谁谁中奖了*/
			//玩具
			Array(1302063,20, 1, 1),//燃烧的火焰刀
			Array(1302106,200, 1, 1),//燃烧的火焰刀
			Array(1302107,0, 1, 1),//至尊黄金武器
			Array(1332237,0, 1, 1),//至尊黄金武器
			Array(1382144,0, 1, 1),//至尊黄金武器
			Array(1402130,0, 1, 1),//至尊黄金武器
			Array(1422090,0, 1, 1),//至尊黄金武器
			Array(1432118,0, 1, 1),//至尊黄金武器
			Array(1452148,0, 1, 1),//至尊黄金武器
			Array(1462138,0, 1, 1),//至尊黄金武器
			Array(1472160,0, 1, 1),//至尊黄金武器
			Array(1482121,0, 1, 1),//至尊黄金武器
			Array(1492121,0, 1, 1),//至尊黄金武器	
			
Array(2610001,1,1,1), 
Array(2531006,1,1,1), 
Array(2450000,20,1,1), 
Array(2590000,1,1,1), 
Array(2041226,3,1,1), 
Array(2047954,3,1,1), 
Array(2049345,300,1,1), 
Array(2049346,300,1,1), 
Array(2049347,300,1,1), 
Array(2049348,300,1,1), 
Array(2049349,300,1,1), 
			
Array(2070013,300,1,1), 
Array(2070016,300,1,1),
Array(2070023,3,1,1),
Array(2070024,300,1,1),
Array(2070011,300,1,1),
Array(2070007,3,1,1),
Array(4251200,300,1,1),
Array(4251201,50,1,1),
Array(4251202,10,1,1),

Array(4250500,500,1,1),
Array(4250501,50,1,1),
Array(4250502,10,1,1),

Array(4250300,500,1,1),
Array(4250301,50,1,1),
Array(4250302,10,1,1),

Array(4250200,500,1,1),
Array(4250201,50,1,1),
Array(4250200,10,1,1),

Array(4250100,500,1,1),
Array(4250101,50,1,1),
Array(4250102,10,1,1),

Array(4250000,500,1,1),
Array(4250001,50,1,1),
Array(4250002,10,1,1),

Array(4251102,300,1,1), 
Array(4251101,500,1,1), 
Array(4251101,500,1,1),
Array(4251002,300,1,1),
Array(4251001,500,1,1),
Array(4251000,500,1,1),
Array(4250902,300,1,1),
Array(4250901,500,1,1),
Array(4250900,500,1,1),
Array(4250802,300,1,1),
Array(4250801,500,1,1),
Array(4250800,500,1,1),
Array(4251400,500,1,1),
Array(4251401,500,1,1),
Array(4251402,300,1,1),

Array(4000464,50,1,1),
Array(4001226,500,1,1),
Array(4001227,500,1,1),
Array(4001228,500,1,1),
Array(4001229,500,1,1),
Array(4001230,500,1,1),
Array(4310044,5,1,1),

Array(4005001,500,1,1),
Array(4005002,500,1,1),
Array(4005000,500,1,1),
Array(4005003,500,1,1),
Array(4005004,500,1,1),

Array(4002000,500,1,1),
Array(4002001,500,1,1),
Array(4002002,500,1,1),
Array(4002003,500,1,1),
Array(3994026,10,1,1),
Array(3994027,10,1,1),


			//Array(2044908,20,1,1),//单手剑攻击卷轴(必成)
			//Array(2044815,20,1,1),//双手剑攻击卷轴(必成)
			//Array(2044703,20,1,1),//枪攻击攻击卷轴(必成)
			//Array(2044603,20,1,1),//矛攻击攻击卷轴(必成)
			//Array(2044503,20,1,1),//弓攻击攻击卷轴(必成)
			//Array(2044403,20,1,1),//弩攻击必成卷
			//Array(2044303,20,1,1),//短杖攻击必成卷
			//Array(2044203,20,1,1),//长杖攻击诅轴(必成)
			//Array(2044103,20,1,1),//短剑攻击必成卷
			//Array(2044019,20,1,1),//拳套攻击诅轴(必成)
			//Array(2044003,20,1,1),//短枪攻击卷轴(必成)
			//Array(2043803,20,1,1),//指节攻击必成卷
			//Array(2043703,20,1,1),//手套攻击卷轴(必成)
			//Array(2043303,20,1,1),//手套魔力卷轴(必成)
			//Array(2043203,20,1,1),//全身铠甲敏捷卷轴(必成)
			//Array(2043103,20,1,1),//全身铠甲力量卷轴(必成)
		//	Array(2043003,20,1,1),//全身铠甲智力卷轴(必成)
		//	Array(2041025,200,1,1),//全身铠甲运气卷轴(必成)
		//	Array(2041024,200,1,1),//腰带智力卷轴(必成)
		//	Array(2040903,200,1,1),//腰带力量卷轴(必成)
	//		Array(2040806,200,1,1),//腰带运气卷轴(必成)
	//		Array(2040711,200,1,1),//腰带敏捷卷轴(必成)
		//	Array(2040710 ,200,1,1),//耳环智力必成卷(必成)
		//	Array(2040709 ,200,1,1),//耳环运气必成卷(必成)
			//Array(2040603 ,200,1,1),//耳环敏捷必成卷(必成)
			//Array(2040507 ,200,1,1),//戒指敏捷必成卷(必成)
	//		Array(2040506 ,50,1,1),//戒指力量必成卷(必成)
		//	Array(2040403 ,200,1,1),//戒指运气必成卷(必成)
			//Array(2040303 ,200,1,1),//戒指智力必成卷(必成)
	//		Array(2040007 ,200,1,1),//披风力量
		//	Array(2040006 ,200,1,1),//披风力量
			


Array(4021010,300,1,1),

Array(4170001,500,1,1),
Array(4170002,500,1,1),
Array(4170003,500,1,1),
Array(4170004,500,1,1),
Array(4170007,500,1,1),

Array(4170017,50,1,1),
Array(4170014,50,1,1),
Array(4170015,50,1,1),
Array(4170016,50,1,1),			
Array(1132211,1, 1, 1),//海盗
Array(1132212,1, 1, 1),//海盗
Array(1132213,1, 1, 1),//海盗
Array(1132214,1, 1, 1),//海盗
Array(1132215,1, 1, 1),//海盗
Array(1132169,5, 1, 1),//海盗
Array(1132170,5, 1, 1),//海盗
Array(1132171,5, 1, 1),//海盗
Array(1132172,5, 1, 1),//海盗
Array(1132173,5, 1, 1),//海盗
Array(1102476,5, 1, 1),//海盗
Array(1102477,5, 1, 1),//海盗
Array(1102478,5, 1, 1),//海盗
Array(1102479,5, 1, 1),//海盗
Array(1102480,5, 1, 1),//海盗
Array(1072737,5, 1, 1),//海盗
Array(1072738,5, 1, 1),//海盗
Array(1072739,5, 1, 1),//海盗
Array(1072740,5, 1, 1),//海盗
Array(1072741,5, 1, 1),//海盗
Array(1432182,50, 1, 1), //红色枪
Array(1382226,50, 1, 1), //红色长杖  
Array(1452220,50, 1, 1), //红色弓                           
Array(1462208,50, 1, 1), //红色之弩
Array(1332242,50, 1, 1), //红色切割者
Array(1472230,50, 1, 1), //红色拳套 
Array(1482183,50, 1, 1), //红色拳甲  
Array(1492194,50, 1, 1), //红色短枪 
Array(1402214,50, 1, 1), //双手剑
Array(1312153,300, 1, 1),//法弗纳双刃切肉斧
Array(1322203,300, 1, 1),//法弗纳戈耳迪锤
Array(1332225,300, 1, 1),//法弗纳大马士革剑
Array(1362090,300, 1, 1),//法弗纳洞察手杖
Array(1372177,300, 1, 1),//法弗纳魔力夺取者
Array(1382208,300, 1, 1),//法弗纳魔冠之杖
Array(1402196,300, 1, 1),//法弗纳忏悔之剑
Array(1412135,300, 1, 1),//法弗纳战斗切肉斧
Array(1422140,300, 1, 1),//法弗纳闪电锤
Array(1432167,300, 1, 1),//法弗纳贯雷枪
Array(1442223,300, 1, 1),//法弗纳半月宽刃斧
Array(1452205,300, 1, 1),//法弗纳追风者
Array(1462193,300, 1, 1),//法弗纳风翼弩
Array(1472214,300, 1, 1),//法弗纳危险之手
Array(1482168,300, 1, 1),//法弗纳巨狼之爪
Array(1492179,300, 1, 1),//法弗纳左轮枪
Array(1302275,50, 1, 1),//法弗纳银槲之剑
Array(1122029,50, 1, 1), //苏醒的冒险之心         
Array(1122030,50, 1, 1), //苏醒的冒险之心         
Array(1122031,50, 1, 1), //苏醒的冒险之心         
Array(1122032,50, 1, 1), //苏醒的冒险之心         
Array(1122033,50, 1, 1), //苏醒的冒险之心         
Array(1122034,50, 1, 1), //觉醒的冒险之心         
Array(1122035,50, 1, 1), //觉醒的冒险之心
Array(1122036,50, 1, 1), //觉醒的冒险之心
Array(1122037,50, 1, 1), //觉醒的冒险之心
Array(1122038,50, 1, 1), //觉醒的冒险之心 
Array(1032205,50, 1, 1),//神话耳环复原第3阶段 - (无描述)
Array(1032206,50, 1, 1),//神话耳环复原第3阶段 - (无描述)
Array(1032207,50, 1, 1),//神话耳环复原第3阶段 - (无描述)
Array(1032208,5, 1, 1),//神话耳环复原第3阶段 - (无描述)
Array(1032209,5, 1, 1),//神话耳环复原第4阶段 - (无描述)
//Array(1032219,50, 1, 1),//遗忘之神话耳环 - (无描述)
Array(3010070,20, 1, 1),  //巨无霸品克缤
Array(3015051,20, 1, 1),  //巨无霸国际巨星
Array(3010025,50, 1, 1),  //枫叶纪念凳
Array(3010044,50, 1, 1),  //同一红伞下
Array(4251102,300,1,1), 
Array(4251101,500,1,1), 
Array(4251101,500,1,1),
Array(4251002,300,1,1),
Array(4251001,500,1,1),
Array(4251000,500,1,1),
Array(4250902,300,1,1),
Array(4250901,500,1,1),
Array(4250900,500,1,1),
Array(4250802,300,1,1),
Array(4250801,500,1,1),
Array(4250800,500,1,1),
Array(4251400,500,1,1),
Array(4251401,500,1,1),
Array(4251402,300,1,1),

Array(4000464,50,1,1),
Array(4001226,500,1,1),
Array(4001227,500,1,1),
Array(4001228,500,1,1),
Array(4001229,500,1,1),
Array(4001230,500,1,1),
Array(4310070,500,1,1),
Array(4310044,5,1,1),
Array(4310058,1,1,1),


Array(4005001,500,1,1),
Array(4005002,500,1,1),
Array(4005000,500,1,1),
Array(4005003,500,1,1),
Array(4005004,500,1,1),

Array(4002000,500,1,1),
Array(4002001,500,1,1),
Array(4002002,500,1,1),
Array(4002003,500,1,1),

Array(4310149,200,1,1),//

			



Array(3010026,300,1,1), 
Array(3010045,500,1,1), 
Array(3010048,500,1,1),
Array(3010053,300,1,1),
Array(3010068,500,1,1),
Array(3010077,500,1,1),
Array(3010078,300,1,1),
Array(3010079,500,1,1),
Array(3010085,500,1,1),
Array(3010094,300,1,1),
Array(3010099,500,1,1),
Array(3010100,500,1,1),
Array(3010110,500,1,1),
Array(3010113,500,1,1),
Array(3010116,300,1,1),

Array(3010118,50,1,1),
Array(3010119,500,1,1),
Array(3010124,500,1,1),
Array(3010135,500,1,1),
Array(3010137,500,1,1),
Array(3010141,500,1,1),
Array(3010142,100,1,1),
Array(3010144,500,1,1),
Array(3010732,500,1,1),
Array(3010737,500,1,1),
Array(3010145,500,1,1),
Array(3010146,500,1,1),
Array(3010151,500,1,1),
Array(3010155,500,1,1),

Array(3010157,500,1,1),
Array(3010168,500,1,1),
Array(3010170,500,1,1),
Array(3010172,500,1,1),
Array(3010173,500,1,1),

Array(3010175,500,1,1),
Array(3010180,500,1,1),
Array(3010181,500,1,1),
Array(3010183,500,1,1),

Array(3010184,200,1,1),

Array(3010186,500,1,1),
Array(3010188,500,1,1),
Array(3010189,500,1,1),

// 未登记
Array(3015372,500,1,1),
Array(3015376,500,1,1),
Array(3015415,500,1,1),
Array(3015419,500,1,1),
Array(3015430,500,1,1),
Array(3015426,500,1,1),
Array(3015439,500,1,1),
Array(3010070,20, 1, 1),  //巨无霸品克缤
Array(3015051,20, 1, 1),  //巨无霸国际巨星
Array(3010025,50, 1, 1),  //枫叶纪念凳
Array(3010044,50, 1, 1),  //同一红伞下
Array(3015482,500,1,1),


Array(1102713,500,1,1),
Array(1102714,500,1,1),
Array(1102715,500,1,1),
Array(1102716,500,1,1),
Array(1102717,500,1,1),
Array(1052275,500,1,1),
Array(1052209,500,1,1),
Array(1052580,500,1,1),
Array(1052581,500,1,1),
Array(1052582,500,1,1),
Array(1052583,500,1,1),
Array(1052584,500,1,1),
Array(1052649,500,1,1),
Array(1052650,500,1,1),
Array(1052651,500,1,1),
Array(1052652,500,1,1),
Array(1052648,500,1,1),
Array(1052804,500,1,1),
Array(1052805,500,1,1),
Array(1052806,500,1,1),
Array(1052807,500,1,1),
Array(1052808,500,1,1),
Array(1072786,500,1,1),
Array(1072787,500,1,1),
Array(1072788,500,1,1),
Array(1072789,500,1,1),
Array(1072790,500,1,1)  //切记不要加","号
			
			/*
			
        这里很重要  这里是Array的结束段落 记住最后一排的 Array函数后面是没有逗号的  这个逗号我截图在你QQ上去 
			*/

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {//这里就是脚本开始的地方
			if (cm.haveItem(4310088,1)) {//判断充值币是否为10个 如果有 就进行下面一段
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("所有道具中奖率都是100%具体你能拿到什么就看手气来！\r\n消耗#v4310088#抽取以下物品! " + str1);
			} else {//如果没有10个充值币就进行下面一段
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("所有道具中奖率都是100%具体你能拿到什么就看手气来！\r\n消耗#v4310088#抽取以下物品! " + str1);
				cm.dispose();
			}//第一次判断结束的标志
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "RED币抽奖", notice);
            if (item != -1) {
					cm.gainItem(4310088,-1);//中奖之后扣除充值币的函数
				if (itemId==1442029){
					cm.gainItem(1442029,-1); //优秀玩家勋章
				    cm.gainItem(1442029,0,0,0,0,0,0,175,0,0,0,0,0,0,0); //优秀玩家勋章
				}
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            status = -1;
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：白雪人法老的蓝宝石。)");
           cm.gainItem(4310088,-1);//中奖之后扣除充值币的函数
            cm.gainItem(4001322, 1);
            status = -1;
        }
    }
}
