
var 红色双箭头 = "#fUI/UIWindow.img/Quest/icon9/0#";
var 蓝色双箭头 = "#fUI/UIWindow.img/Quest/icon8/0#";
var 选择道具图标 = "#fUI/UIWindow.img/QuestIcon/3/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 铅笔图标 = "#fUI/UIWindow.img/PvP/btWrite/mouseOver/0#";
var 警报灯 = "#fUI/StatusBar/BtClaim/normal/0#";
var H字母 = "#fUI/CashShop/CSEffect/effect/1#";
var 金币图标 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 兑换倍率 = "1.5";
function start() {
	status = -1;
	action(1, 0, 0);
}
function action(mode, type, selection) {
	if (mode == -1) {
		cm.sendOk("#b好的,下次再见.");
		cm.dispose();
		} else {
	if (status >= 0 && mode == 0) {
		cm.sendOk("#b好的,下次再见.");
		cm.dispose();
		return;
		}
	if (mode == 1) {
		status++;
		} else {
		status--;
		}

	if (status == 0) {
   	    var text= "\t\t\t\t  "+铅笔图标+" [充值礼包] "+铅笔图标+"\r\n\r\n";
		text += "\t\t\t"+警报灯+" #d您目前累计赞助: #r"+cm.getPlayer().getBossLog("累计赞助积分", 1)+" 元 "+警报灯+"\r\n";
		text += "#e#d#L1#"+蓝色角点+" 充值累计满#r99#d礼包:#d#l\r\n\r\n\t #v1912000#全属性+300  #v2047933#*1 #v2049323#*10  #v4170000#*10 #v5211060#*1（永久） \r\n\r\n";
		
		text += "#d#L2#"+蓝色角点+" 充值累计满#r299#d礼包:#d#l\r\n\r\n\t #v1902001#全属性+300  #v2047933#*1 #v2049323#*20  #v4170000#*30 #v2614001#*1 #v5360016#永久 #v4002001#*1 \r\n\r\n";
		
		text += "#d#L3#"+蓝色角点+" 充值累计满#r499#d礼包:#d#l\r\n\r\n\t#v1112444#全属性+350   #v2047933#*1 #v2049323#*30  #v2614001#*2 #v4170000#*50 #v2533000#*5 #v2041226#*3 #v4002001#*2\r\n\r\n";
		
		text += "#d#L4#"+蓝色角点+" 充值累计满#r999#d礼包:#d#l\r\n\r\n\t#v1112734#全属性+350  #v2047933#*2 #v2049323#*50 #v2614001#*3 #v4031868#*10 #v4170000#*100 #v2533000#*5 #v2041226#*5  #v4002001#*4 \r\n\r\n";
		
		text += "#d#L5#"+蓝色角点+" 充值累计满#r1499#d礼包:#d#l\r\n\r\n\t#v1912344#全属性+400 #v2614001#*4 #v2049323#*50  #v4441100#任选武器*1 #v4170000#*150 #v2533000#*5  #v2041226#*5 #v2047954#*1 #v4002001#*6\r\n\r\n";
		
		text += "#d#L6#"+蓝色角点+" 充值累计满#r1999#d礼包:#d#l\r\n\r\n\t#v1902344#全属性+400 #v2614001#*5 #v4170000#*200 #v2049323#*50 #v2049345#*100 #v2531000#*25 #v2533000#*5 #v2613008#*5 #v2041226#*5 #v4002001#*8 \r\n\r\n";
		
		text += "#d#L7#"+蓝色角点+" 充值累计满#r2999#d礼包:#d#l\r\n\r\n\t#v1112946#全属性+500 #v2614001#*6 #v4170000#*300 #v2049323#*100 #v2049346#*100 #v2531006#*50 #v2533000#*10 #v2613008#*10 #v2041226#*10 #v4002001#*10 \r\n\r\n";
		
		text += "#d#L8#"+蓝色角点+" 充值累计满#r3999#d礼包:#d#l\r\n\r\n\t#v2614001#*7 #v1002186#全属性+500 #v4170000#*400  #v2049323#*100 #v2049347#*100 #v2531000#*50 #v2533000#*10 #v2613008#*10  #v2049600#*100  #v2041226#*10 #v4002001#*12 \r\n\r\n";
		
		text += "#d#L9#"+蓝色角点+" 充值累计满#r4999#d礼包:#d#l\r\n\r\n\t#v1112178#全属性+500 #v2614001#*8 #v4170000#*500 #v2049323#*100 #v2049348#*100 #v2531000#*100  #v2533000#*10 #v2613008#*10  #v2049600#*100 #v2041226#*10 #v4002001#*15\r\n\r\n";
		
		//text += "#d#L10#"+蓝色角点+" 充值累计满#r6999#d礼包:#d#l\r\n\r\n\t #v2614001#*20   #v1082102#全属性+1299    #v2049323#*100 #v2049349#*100 #v2531006#*200 #v2533000#*50 #v2613008#*50  #v2049600#*100  #v4002001#*30 元宝+200\r\n\r\n";
		
		//text += "#e#d#L11#"+蓝色角点+" 充值累计满#r9999#d礼包:#d#l\r\n\r\n\t #v1012057#全属性+2888   #v2613008#*100 #v2614001#*50 #v4002001#*50 #v2049348#*100 #v2049347#*100  #v2531006#*200 #v2533000#*100 #v2049600#*100 #v2610001#*2 元宝+500 \r\n\r\n";
		
		//text += "#e#d#L12#"+蓝色角点+" 充值累计满#r14999#d礼包:#d#l\r\n\r\n\t #v1042142#全属性+5888   #v2613008#*200 #v2614001#*150 #v4002001#*150 #v2049348#*200 #v2049347#*200  #v2531006#*200 #v2533000#*200 #v2049600#*200 #v2610001#*5 元宝+1000 \r\n\r\n";
		
		//text += "#e#d#L13#"+蓝色角点+" 充值累计满#r19999#d礼包:#d#l\r\n\r\n\t #v1062054#全属性+9999   #v2613008#*500 #v2614001#*150 #v4002001#*150 #v2610003#*500 #v2049347#*500  #v2531006#*500 #v2533000#*500 #v2049600#*500 #v2610001#*5 \r\n\r\n";

        //text += "#e#d#L14#"+蓝色角点+" 充值累计满#r24999#d礼包:#d#l\r\n\r\n\t #v1112903#全属性+13888   #v2613008#*700 #v2614005#*40 #v4002001#*360 #v2610003#*700 #v2049347#*700  #v2531006#*700 #v2533000#*700 #v2049600#*700 #v2610001#*5 \r\n\r\n";

        //text += "#e#d#L15#"+蓝色角点+" 充值累计满#r29999#d礼包:#d#l\r\n\r\n\t #v1002186#全属性+18888   #v2613008#*800 #v2048904#*100 #v2614005#*80 #v4002001#*500 #v2610003#*800 #v2049347#*800  #v2531006#*800 #v2533000#*800 #v2049600#*800 #v2610001#*5 \r\n\r\n";
        
		//text += "#e#d#L16#"+蓝色角点+" 充值累计满#r34999#d礼包:#d#l\r\n\r\n\t #v1072153#全属性+28888   #v4310080#*40 #v2048904#*200 #v2614005#*80 #v4002001#*800 #v2531006#*800 #v2531006#*800  #v2531006#*800 #v2531006#*800 #v2531006#*800 #v2610001#*5 \r\n\r\n";
        
		//text += "#e#d#L17#"+蓝色角点+" 充值累计满#r39999#d礼包:#d#l\r\n\r\n\t #v1702457#全属性+32767   #v4310080#*60 #v2048904#*300 #v2614005#*80 #v4002001#*1000 #v2531006#*800 #v2531006#*800  #v2531006#*800 #v2531006#*800 #v2531006#*800 #v2610001#*5 \r\n\r\n";
	    
		//text += "#e#d#L18#"+蓝色角点+" 充值累计满#r44999#d礼包:#d#l\r\n\r\n\t #v1112135#全属性+32767   #v4310080#*160 #v2048904#*800 #v2614005#*200 #v4002001#*1500 #v2531006#*800 #v2531006#*800  #v2531006#*800 #v2531006#*800 #v2531006#*800 #v2610001#*5 \r\n\r\n";
		
		//text += "#e#d#L19#"+蓝色角点+" 充值累计满#r49999#d礼包:#d#l\r\n\r\n\t #v1112405#全属性+32767   #v4310080#*200 #v2048904#*1000 #v2614005#*250 #v4002001#*2000 #v2531006#*800 #v2531006#*800  #v2531006#*800 #v2531006#*800 #v2531006#*800 #v2610001#*5 \r\n\r\n";
		
		//text += "#e#d#L20#"+蓝色角点+" 充值累计满#r54999#d礼包:#d#l\r\n\r\n\t #v1912336#全属性+32767   #v4310080#*300 #v2048904#*1500 #v2614005#*350 #v4002001#*2000 #v2531006#*800 #v2531006#*800  #v2531006#*800 #v2531006#*800 #v2531006#*800 #v2610001#*5 \r\n\r\n";
		
		//text += "#e#d#L21#"+蓝色角点+" 充值累计满#r59999#d礼包:#d#l\r\n\r\n\t #v1902336#全属性+32767   #v4310080#*400 #v2048904#*2000 #v2614005#*450 #v4002001#*2000 #v2531006#*800 #v2531006#*800  #v2531006#*800 #v2531006#*800 #v2531006#*800 #v2610001#*5 \r\n\r\n";

		cm.sendSimple(text);    
	} else if (status == 1) {
		if (selection == 1) {     
		if(cm.获取礼包等级() == 0 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 99){
			cm.设置礼包等级(1);
			
			cm.gainItem(1912000,300,300,300,300,300,300,300,300,300,300,300,300,300,300);	
			cm.gainItem(4170000,10);
			//cm.gainItem(4031868,1);
			cm.gainItem(2049323,10);
			cm.gainItem(2047933,1);
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +10000)
			cm.gainItem(5211060,1);
			//cm.gainItem(4001126,6000);
			//cm.gainItem(3994578,200);
			//cm.更改仓库金币(1);
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 99 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
		}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 2) {
		if(cm.获取礼包等级() == 1 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 299){
			cm.设置礼包等级(2);
			cm.gainItem(1902001,300,300,300,300,0,0,300,300,300,300,300,300,300,300);
			//cm.gainItem(1112915,30,30,30,30,30,30,30,30,0,0,0,0,0,0);			
			//cm.gainItem(3994731,10);
			cm.gainItem(2049323,20);
			//cm.gainItem(4031868,1);
			cm.gainItem(4002001,1);//金币
			cm.gainItem(2047933,1);
			cm.gainItem(4170000,30);
			//cm.gainItem(4031868,2);
			cm.gainItem(5360016,1);
			cm.gainItem(2614001,1);//坡贡
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +20000)
			// cm.gainItem(4170000,20);
			// cm.gainItem(4310054,60);
			// cm.gainItem(3994578,400);
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 299 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
		}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 3) {
		if(cm.获取礼包等级() == 2 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 499){
			cm.设置礼包等级(3);
			//cm.gainItem(1022048,30,30,30,30,30,30,30,30,30,30,30,30,30,30);
			cm.gainItem(1112444,350,350,350,350,350,350,350,350,350,350,350,350,350,350);
			//cm.gainItem(3994731,20);
			cm.gainItem(2049323,30);
			//cm.gainItem(4031868,1);
			cm.gainItem(2533000,5);
			cm.gainItem(4170000,50);
			cm.gainItem(2614001,2);//坡贡
			cm.gainItem(2047933,1);
			//cm.gainItem(4031868,3);
			cm.gainItem(2041226,3);
			cm.gainItem(4002001,2);//金币
			// cm.gainItem(2047954,5);
			//cm.gainItem(4001126,20000);
			// cm.gainItem(3994578,400);
			//cm.gainItem(4440101,1);
			// cm.gainItem(5360016,1);
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +20000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 499 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
		}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 4) {
		if(cm.获取礼包等级() == 3 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 999){
			cm.设置礼包等级(4);
			cm.gainItem(1112734,350,350,350,350,350,350,350,350,350,350,350,350,350,350);
			// cm.gainItem(4442000,1);
			//cm.gainItem(3994731,40);
			cm.gainItem(2049323,50);
			cm.gainItem(2533000,5);
			cm.gainItem(4002001,4);//金币
			cm.gainItem(2047933,2);
			cm.gainItem(4170000,100);
			cm.gainItem(4031868,10);
			cm.gainItem(2614001,3);//坡贡
			cm.gainItem(2041226,5);
			// cm.gainItem(2047954,10);
			//cm.gainItem(5211060,1);
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +50000)
			//cm.gainItem(4442001,5);
			// cm.gainItem(3994578,800);
			//cm.gainItem(4001126,50000);
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
		}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 5) {
		if(cm.获取礼包等级() == 4 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 1499){
			cm.设置礼包等级(5);
			cm.gainItem(1912344,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112915,100,100,100,100,100,100,100,100,0,0,0,0,0,0);
			//cm.gainItem(4310080,6);//枫叶币
			cm.gainItem(2049323,50);
			cm.gainItem(2533000,5);
			cm.gainItem(4170000,150);
			cm.gainItem(4002001,6);//金币
			//cm.gainItem(4031868,1)
			cm.gainItem(2614001,4);//坡贡
			cm.gainItem(2041226,5);
			// cm.gainItem(2047954,10);
			cm.gainItem(4441100,1);
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +100000)
			cm.gainItem(2047954,10);//鱼王门票
			
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 1499 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
		}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 6) {
		if(cm.获取礼包等级() == 5 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 1999){
			cm.设置礼包等级(6);
			cm.gainItem(1902344,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112915,150,150,150,150,150,150,150,150,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2049323,50);//高级强化
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(2049345,100);//祝福卷
			cm.gainItem(2531000,25);//防爆卷
			cm.gainItem(4170000,200);
			//cm.gainItem(4031868,1);//元宝卡
			cm.gainItem(2533000,5);
			cm.gainItem(4002001,8);//金币
			cm.gainItem(2614001,5);//坡贡
			cm.gainItem(2613008,5);//鱼王门票
			cm.gainItem(2041226,5);
			// cm.gainItem(4310071,20);//绯红门票
			// cm.gainItem(4443000,1);//属性时装宝石
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +100000)
			//cm.gainItem(4443000,1);//强化宝石
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 1999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
		}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 7) {
		if(cm.获取礼包等级() == 6 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 2999){
			cm.设置礼包等级(7);
			cm.gainItem(1112946,500,500,500,500,500,500,500,500,500,500,500,500,500,500);
			//cm.gainItem(1022048,150,150,150,150,150,150,150,150,150,150,150,150,150,150);
			//cm.gainItem(1112915,150,150,150,150,150,150,150,150,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2049323,100);//高级强化
			cm.gainItem(4170000,300);
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(2049346,100);//祝福卷
			cm.gainItem(2531000,50);//防爆卷
			//cm.gainItem(4031868,1);//元宝卡
			cm.gainItem(2614001,6);//坡贡
			cm.gainItem(2533000,10);
			cm.gainItem(4002001,10);//金币
			cm.gainItem(2613008,10);//鱼王门票
			cm.gainItem(2041226,10);
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +100000)
			// cm.gainItem(4310070,30);//鱼王门票
			// cm.gainItem(4310071,30);//绯红门票
			// cm.gainItem(4443000,1);//属性时装宝石
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 2999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 8) {
		if(cm.获取礼包等级() == 7 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 3999){
			cm.设置礼包等级(8);
			cm.gainItem(1002186,500,500,500,500,500,500,500,500,500,500,500,500,500,500);
			//cm.gainItem(1112916,200,200,200,200,200,200,200,200,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2049323,100);//高级强化
			cm.gainItem(4170000,400);
			//cm.gainItem(4440300,1);//金币
			cm.gainItem(2049347,100);//祝福卷
			cm.gainItem(4002001,12);//金币
			cm.gainItem(2531000,50);//防爆卷
			//cm.gainItem(4031868,1);//元宝卡
			cm.gainItem(2533000,10);
			cm.gainItem(2614001,7);//坡贡
			cm.gainItem(2613008,10);//鱼王门票
			cm.gainItem(2049600,100);//鱼王门票
			cm.gainItem(2041226,10);
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +100000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 3999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		}
		} else if (selection == 9) {
		if(cm.获取礼包等级() == 8 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 4999){
			cm.设置礼包等级(9);
			cm.gainItem(1112178,500,500,500,500,500,500,500,500,500,500,500,500,500,500);
			//cm.gainItem(1112290,300,300,300,300,300,300,300,300,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2049323,100);//高级强化
			cm.gainItem(4170000,500);
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(2049348,100);//祝福卷
			cm.gainItem(2531000,100);//防爆卷
			//cm.gainItem(4031868,1);//元宝卡
			cm.gainItem(2533000,10);
			cm.gainItem(2614001,8);//坡贡
			cm.gainItem(2613008,10);//鱼王门票
			cm.gainItem(2049600,100);//鱼王门票
			cm.gainItem(2041226,10);
			cm.gainItem(4002001,15);//金币
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			// cm.gainItem(3994578,3200);//元宝卡
			// cm.gainItem(4310070,50);//鱼王门票
			// cm.gainItem(4310071,50);//绯红门票
			// cm.gainItem(4441000,1);//属性时装宝石
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 4999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 10) {
		if(cm.获取礼包等级() == 9 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 6999){
			cm.设置礼包等级(10);
			//cm.gainItem(1142802,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			cm.gainItem(1082102,1299,1299,1299,1299,1299,1299,1299,1299,1299,1299,1299,1299,1299,1299);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2049323,200);//高级强化
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(2049349,100);//祝福卷
			cm.gainItem(2531000,100);//防爆卷
			//cm.gainItem(4031868,1);//元宝卡
			cm.gainItem(4002001,30);//金币
			cm.gainItem(2533000,50);
			cm.gainItem(2613008,50);//鱼王门票
			cm.gainItem(2049600,100);//鱼王门票
			//cm.gainItem(4442300,1);//绯红门票
			cm.gainItem(2614001,20);//坡贡
			cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +200)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 6999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 11) {
		if(cm.获取礼包等级() == 10 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 9999){
			cm.设置礼包等级(11);
			cm.gainItem(1012057,2888,2888,2888,2888,2888,2888,2888,2888,2888,2888,2888,2888,2888,2888);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614001,50);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,50);//金币
			cm.gainItem(2613008,100);//防爆卷
			cm.gainItem(2049348,100);//元宝卡
			cm.gainItem(2049347,100);//元宝卡
			//cm.gainItem(4031868,10);//元宝卡
			cm.gainItem(2533000,100);
			cm.gainItem(2531000,200);//鱼王门票
			cm.gainItem(2049600,100);//绯红门票
			cm.gainItem(2610001,2);//绯红门票
			cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +500)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 9999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
			
		}
		} else if (selection == 12) {
		if(cm.获取礼包等级() == 11 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 14999){
			cm.设置礼包等级(12);
			cm.gainItem(1042142,5888,5888,5888,5888,5888,5888,5888,5888,5888,5888,5888,5888,5888,5888);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614001,150);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,150);//金币
			cm.gainItem(2613008,200);//防爆卷
			cm.gainItem(2049348,200);//元宝卡
			cm.gainItem(2049347,200);//元宝卡
			//cm.gainItem(4031868,10);//元宝卡
			cm.gainItem(2533000,200);
			cm.gainItem(2531000,200);//鱼王门票
			cm.gainItem(2049600,200);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +1000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 14999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
			
		}
		} else if (selection == 13) {
		if(cm.获取礼包等级() == 12 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 19999){
			cm.设置礼包等级(13);
			cm.gainItem(1062054,9999,9999,9999,9999,9999,9999,9999,9999,9999,9999,9999,9999,9999,9999);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614001,150);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,150);//金币
			cm.gainItem(2613008,500);//防爆卷
			cm.gainItem(2610003,500);//元宝卡
			cm.gainItem(2049347,500);//元宝卡
			//cm.gainItem(4031868,10);//元宝卡
			cm.gainItem(2533000,500);
			cm.gainItem(2531000,500);//鱼王门票
			cm.gainItem(2049600,500);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 19999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
	    } else if (selection == 14) {
		if(cm.获取礼包等级() == 13 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 24999){
			cm.设置礼包等级(14);
			cm.gainItem(1112903,13888,13888,13888,13888,13888,13888,13888,13888,13888,13888,13888,13888,13888,13888);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,40);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,360);//金币
			cm.gainItem(2613008,700);//防爆卷
			cm.gainItem(2610003,700);//元宝卡
			cm.gainItem(2049347,700);//元宝卡
			//cm.gainItem(4031868,10);//元宝卡
			cm.gainItem(2533000,700);
			cm.gainItem(2531000,700);//鱼王门票
			cm.gainItem(2049600,700);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 24999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 15) {
		if(cm.获取礼包等级() == 14 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 29999){
			cm.设置礼包等级(15);
			cm.gainItem(1002186,18888,18888,18888,18888,18888,18888,18888,18888,18888,18888,18888,18888,18888,18888);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,80);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,500);//金币
			cm.gainItem(2613008,800);//防爆卷
			cm.gainItem(2610003,800);//元宝卡
			cm.gainItem(2049347,800);//元宝卡
			cm.gainItem(2048904,100);//元宝卡
			cm.gainItem(2533000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2049600,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 29999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 16) {
		if(cm.获取礼包等级() == 15 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 34999){
			cm.设置礼包等级(16);
			cm.gainItem(1072153,28888,28888,28888,28888,28888,28888,28888,28888,28888,28888,28888,28888,28888,28888);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,80);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,800);//金币
			cm.gainItem(4310080,40);//防爆卷
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2048904,200);//元宝卡
			cm.gainItem(2531000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2531000,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 34999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 17) {
		if(cm.获取礼包等级() == 16 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 39999){
			cm.设置礼包等级(17);
			cm.gainItem(1702457,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,80);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,1000);//金币
			cm.gainItem(4310080,60);//防爆卷
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2048904,300);//元宝卡
			cm.gainItem(2531000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2531000,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 39999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 18) {
		if(cm.获取礼包等级() == 17 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 44999){
			cm.设置礼包等级(18);
			cm.gainItem(1112135,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,200);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,1500);//金币
			cm.gainItem(4310080,160);//防爆卷
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2048904,800);//元宝卡
			cm.gainItem(2531000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2531000,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 44999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 19) {
		if(cm.获取礼包等级() == 18 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 49999){
			cm.设置礼包等级(19);
			cm.gainItem(1112405,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,250);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,1000);//金币
			cm.gainItem(4310080,200);//防爆卷
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2048904,1000);//元宝卡
			cm.gainItem(2531000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2531000,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 49999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 20) {
		if(cm.获取礼包等级() == 19 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 54999){
			cm.设置礼包等级(20);
			cm.gainItem(1912336,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,350);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,1000);//金币
			cm.gainItem(4310080,300);//防爆卷
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2048904,1500);//元宝卡
			cm.gainItem(2531000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2531000,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 54999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
		} else if (selection == 21) {
		if(cm.获取礼包等级() == 20 && cm.getPlayer().getBossLog("累计赞助积分", 1) >= 59999){
			cm.设置礼包等级(21);
			cm.gainItem(1902336,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767,32767);
			//cm.gainItem(1082102,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1112946,400,400,400,400,400,400,400,400,400,400,400,400,400,400);
			//cm.gainItem(1022073,400,400,400,400,400,400,400,400,0,0,0,0,0,0);
			//cm.gainItem(4310080,12);//枫叶币
			cm.gainItem(2614005,450);//坡贡
			//cm.gainItem(3994731,80);//金币
			cm.gainItem(4002001,1000);//金币
			cm.gainItem(4310080,400);//防爆卷
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2531000,800);//元宝卡
			cm.gainItem(2048904,2000);//元宝卡
			cm.gainItem(2531000,800);
			cm.gainItem(2531000,800);//鱼王门票
			cm.gainItem(2531000,800);//绯红门票
			cm.gainItem(2610001,5);//绯红门票
			//cm.getPlayer().setAccountLog("累计赞助积分_暂用", 1, +250000)
			cm.sendOk("#b领取成功~.");
			cm.喇叭(2, "玩家：[" + cm.getName() + "] 领取了 59999 元赞助礼包,快去打劫他(她)吧！");
			cm.dispose();
			}else{
			cm.sendOk("#b您目前赞助不够或已经领取过了~.");
			cm.dispose();
		
		}
	}
}
}}