var 警报灯 = "#fMob/1210102.img/move/0#";
var 红色双箭头 = "#fUI/UIWindow.img/Quest/icon9/0#";
var 警报灯 = "#fUI/StatusBar/BtClaim/normal/0#";
var 蜗牛 = "#fMob/0100101.img/move/0#";
var selec;
var sele;
var hsddd = 0;
var hsjns = Array(2040017,2040105,2040106,2040200,2040201,2040001,2040002,2040004,2040005,2040016,2040025,2040026,2040029,2040031,2040100,2040101,2040205,2040206,2040301,2040302,2040310,2040311,2040317,2040318,2040321,2040323,2040326,2040328,2040401,2040402,2040412,2040413,2040418,2040419,2040421,2040422,2040425,2040427,2040501,2040502,2040504,2040505,2040513,2040514,2040516,2040517,2040532,2040534,2040601,2040602,2040612,2040613,2040618,2040619,2040621,2040622,2040625,2040627,2040701,2040702,2040704,2040705,2040707,2040708,2040801,2040802,2040804,2040805,2040816,2040817,2040824,2040825,2040901,2040902,2040914,2040915,2040919,2040920,2040924,2040925,2040927,2040928,2040931,2040933,2041001,2041002,2041004,2041005,2041007,2041008,2041010,2041011,2041013,2041014,2041016,2041017,2041019,2041020,2041022,2041023,2041201,2041202,2041206,2041207,2041301,2041304,2041307,2041310,2043001,2043002,2043008,2043009,2043017,2043019,2043101,2043102,2043112,2043114,2043201,2043202,2043212,2043214,2043301,2043302,2043701,2043702,2043801,2043802,2044001,2044002,2044012,2044014,2044101,2044102,2044112,2044114,2044201,2044202,2044212,2044214,2044301,2044302,2044312,2044314,2044401,2044402,2044412,2044414,2044501,2044502,2044601,2044602,2044701,2044702,2044801,2044802,2044807,2044809,2044901,2044902
);//技能书
var hsks = Array(
//矿石 物品ID 单价


);
function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			//显示物品ID图片用的代码是  #v这里写入ID#
            text += " #e#b\t\t\t这里是卷轴分解机#k\r\n\r\n此机器只会分解10%卷轴和60%的卷轴\r\n#r请将你需要的卷轴摆摊或者丢弃，重要的卷轴分解概不负责#k\r\n分解卷轴有几率可以获得以下物品：\r\n#b10点券#k#r（15%）#k#b10抵用#k#r（15%）#k#b 10万金币#k#r（15%）\r\n#k#b100杀怪点#k#r（15%）#k#v4001126##r（15%）#k#v4000313##r（15%）#k#v4310097##r（3%）#k#v4310156##r（2%）#k#v4251202##r（2%）#k#v2049323##r（3%）#k\r\n"//3
            text += "   #L1##e#b一键分解卷轴（一张卷轴需要1000费用）#l     \r\n"
           
            cm.sendSimple(text);
		} else if(status == 1){
			if (selection == 1) {
				var text ="系统自动检测到你可以分解的卷轴如下:\r\n\r\n";
				for(var i = 0; i < hsjns.length; i++){
					var hssl = cm.getPlayer().getItemQuantity(hsjns[i], false);
					if(hssl != 0){
						text += "#v"+hsjns[i]+"##t"+hsjns[i]+"# × "+hssl+"\r\n";
						hsddd += hssl;
					}
				}
				text += "一共可以分解 #r#e"+hsddd+"#n#k 次，是否继续？";
				
				cm.sendYesNo(text);
			}
		} else if(status == 2){
				if(cm.getMeso() >= 2000*hsddd){
					cm.gainMeso(-2000*hsddd);
					cm.dispose();
					if(hsddd != 0){
						for(var i = 0; i < hsjns.length; i++){
							cm.removeAll(hsjns[i]);
						}
						while(hsddd > 0){
							s1 = Math.floor(Math.random() * (100 - 1) + 1);
							if(s1 >=1 && s1 < 15){
								cm.gainNX(10);
								
							} else if(s1 >=15 && s1 < 30){
								cm.gainDY(10);
								
							} else if(s1 >=30 && s1 < 45){
								cm.gainMeso(100000);
								
							} else if(s1 >=45 && s1 < 60){
								cm.getPlayer().setAccountLog("杀怪点数",1, 100);
								
							} else if(s1 >=60 && s1 < 75){
								cm.gainItem(4001126,100);
								
							} else if(s1 >=75 && s1 < 90){
								cm.gainItem(4000313,10);
								
								
								
							} else if(s1 >=90 && s1 < 93){
								cm.gainItem(4310097,1);
								
							} else if(s1 >=93 && s1 < 95){
								cm.gainItem(4310156,1);
								
							} else if(s1 >=95 && s1 < 97){
								cm.gainItem(4251202,1);
								
							} else if(s1 >=97 && s1 < 100){
								cm.gainItem(2049323,1);
								
							} else {
								cm.gainMeso(100000);
							}
							hsddd--;
						}
						cm.sendOk("回收成功,请查看你背包获得了些什么吧~!");
						cm.dispose();
					} else {
						cm.sendOk("你没有可以回收的物品哦~!");
						cm.dispose();
					}
				} else {
					cm.sendOk("金币不足");
					cm.dispose();
				}
			
		}
    }
}

