//load("nashorn:mozilla_compat.js");
//importPackage(Packages.client);
//importPackage(Packages.client.inventory);
//importPackage(Packages.server);
//importPackage(Packages.tools);
var status = 0;
var itemList =   
Array(  

//Array(4001226,20,1,1),//转生

Array(1432182,1,1,1), //红色之矛
//Array(1442182,1,1,1), //红色之矛
Array(1462208,1,1,1), //红色之弩
Array(1492194,1,1,1),// 红色短枪
Array(1402214,1,1,1),//红色双手剑
Array(1452220,1,1,1),//红色弓
Array(1422156,1,1,1),//红色巨锤
Array(1472230,1,1,1),//红色拳甲
Array(1332242,1,1,1),//红色切割者
Array(1382226,1,1,1),//红色长杖
Array(1482183,1,1,1),//红色拳甲
Array(1302063,1,1,1),//燃烧的火焰刀
Array(1092048,1,1,1),//冰刀
Array(1402196,10,1,1),//法弗纳忏悔之剑
Array(1452205,10,1,1),//法弗纳追风者
Array(1462193,10,1,1),//法弗纳追风者
Array(1372177,10,1,1),//法弗纳魔力夺取者
Array(1382208,10,1,1),//法弗纳魔冠之杖
Array(1472214,10,1,1),//法弗纳危险之手
Array(1332225,10,1,1),//法弗纳大马士革剑
Array(1492179,10,1,1),//法弗纳左轮枪
Array(1482168,10,1,1),//法弗纳巨狼之爪
Array(1302275,10,1,1),//法弗纳银槲之剑
Array(1432167,10,1,1),//法弗纳贯雷枪
Array(1442223,10,1,1),//法弗纳半月宽刃斧
Array(1422140,10,1,1),//法弗纳闪电锤
Array(1322203,10,1,1),//法弗纳戈耳迪锤
Array(1412135,10,1,1),//法弗纳战斗切肉斧
Array(1312153,10,1,1),//法弗纳双刃切肉斧

Array(1902339,0,1,1), //红色之矛
Array(1902336,1,1,1), //红色之弩
Array(1902340,5,1,1),//红色双手剑
Array(1902341,5,1,1),//红色巨锤
Array(1902344,5,1,1),//红色切割者
Array(1902338,5,1,1),//红色拳甲
Array(1902342,5,1,1),//冰刀
Array(1902343,5,1,1),//法弗纳追风者
Array(1902345,5,1,1),//法弗纳魔力夺取者
Array(1902337,5,1,1),//法弗纳危险之手
Array(1902346,5,1,1),//法弗纳左轮枪

Array(1032205,500,1,1), //神话耳环
Array(1032206,300,1,1), // 神话耳环复原第1阶段
Array(1032207,400,1,1), //神话耳环复原第2阶段
Array(1032208,10,1,1), //神话耳环复原第3阶段
Array(1032209,1,1,1), //神话耳环复原第4阶段
Array(1012170,50,1,1), //恐怖鬼娃的伤口
Array(1012171,25,1,1), //恐怖鬼娃的伤口
Array(1012172,10,1,1), //恐怖鬼娃的伤口
Array(1012173,5,1,1), //恐怖鬼娃的伤口
Array(1132211,15,1,1), // 冒险岛强韧意志黄色腰带
Array(1132212,10,1,1), //冒险岛强韧意志绿色腰带
Array(1132213,5,1,1), //冒险岛强韧意志蓝色腰带
Array(1132214,1,1,1), //冒险岛强韧意志红色腰带

Array(1112663, 5,1,1), //白天使的祝福
Array(1112586, 5,1,1), //黑天使的祝福
Array(1122125, 10,1,1), //真·觉醒冒险之心
Array(1122123, 10,1,1), //真·觉醒冒险之心
Array(1122122, 10,1,1), //真·觉醒冒险之心
Array(1122126, 10,1,1), //真·觉醒冒险之心
Array(1122124, 10,1,1), //真·觉醒冒险之心
Array(1122266, 5,1,1), //高级贝勒德刻印吊坠
Array(1122265, 50,1,1), //中级贝勒德刻印吊坠
Array(1122264, 500,1,1), //低级贝勒德刻印吊坠
Array(1032222, 5,1,1), //高级贝勒德耳环
Array(1032221, 50,1,1), //中级贝勒德耳环
Array(1032220, 500,1,1), //低级贝勒德耳环
Array(1132245, 5,1,1), //高级贝勒德刻印腰带
Array(1132244, 50,1,1), //中级贝勒德刻印腰带
Array(1132243, 500,1,1), //低级贝勒德刻印腰带
Array(1113074, 5,1,1), //高级贝勒德戒指
Array(1113073, 50,1,1), //中级贝勒德戒指
Array(1113072, 500,1,1), //低级贝勒德戒指	

Array(2040874,150,1,1), //+4首套卷
Array(2040875,150,1,1), //+4首套卷
Array(2040807,600,1,1),// 必成卷

Array(2290125,30,1,1),//30勇士		
Array(1112951,10,1,1),//希腊
Array(1112952,10,1,1),//希腊
Array(1112405,400,1,1),//全属5戒指
Array(2044908,400,1,1), //必成卷
Array(2044815,400,1,1), // 必成卷
Array(2044703,400,1,1), //必成卷
Array(2044603,400,1,1), //必成卷
Array(2044503,400,1,1), //必成卷
Array(2044403,400,1,1), //必成卷
Array(2044303,400,1,1), //必成卷
Array(2044203,400,1,1), //必成卷
Array(2044103,400,1,1), //必成卷
Array(2044003,400,1,1), //必成卷
Array(2043803,400,1,1), // 必成卷
Array(2043703,400,1,1), //必成卷
Array(2043303,400,1,1), //必成卷
Array(2043203,400,1,1), //必成卷
Array(2043103,400,1,1), //必成卷
Array(2043003,400,1,1),// 必成卷
Array(2000004,900,20,0), //特殊药水
Array(2000005,900,30,0), //超级药水
Array(2022245,850,10,0), //心跳停止糖
Array(2040710,500,1,1),//跳跃必成
Array(2040711,500,1,1),//速度必成
Array(1442104,300,1,1),//超级枫叶系列
Array(1322084,900,1,1),
Array(1332114,900,1,1),
Array(1462085,930,1,1),
Array(1372071,900,1,1),
Array(1312056,900,1,1),
Array(1432075,900,1,1),
Array(1382093,900,1,1),
Array(1472111,900,1,1),
Array(1492073,900,1,1),
Array(1302142,900,1,1),
Array(1452100,900,1,1),
Array(1412055,900,1,1),
Array(1422057,900,1,1),
Array(1402085,900,1,1),
Array(1482073,900,1,1),
Array(1402037,50,1,1),//龙背
Array(1092049,100,1,1),//龙背
Array(1432081,30,1,1),//不速
Array(1372035,300,1,1),//4短属性
Array(1372036,300,1,1),
Array(1372037,300,1,1),
Array(1372038,300,1,1),
Array(1382050,50,1,1),
Array(1382051,50,1,1),
Array(1382052,50,1,1),
Array(1382049,50,1,1),
Array(2049100,800,1,1),//混沌
Array(2340000,100,1,1),//祝福卷轴
Array(2040914,900,1,1),//盾牌攻击卷轴 
Array(2040915,900,1,1),//盾牌攻击卷轴 
Array(1002939,500,1,1),//安全帽						
Array(1082149,200,1,1),//工地手套(褐) 		 
Array(1102042,950,1,1),//浪人披风(紫) 
Array(1102041,900,1,1),//浪人披风(粉)			
Array(1102086,900,1,1),//蓝色盖亚披风
Array(1102084,900,1,1),//粉红盖亚披风	
Array(1012071,900,1,1),//雪糕全属性
Array(1012072,900,1,0),//狐猴
Array(1012073,900,1,0),//狐猴
Array(1022060,900,1,0),//狐猴
Array(1022067,800,1,0),//黑狐猴
Array(1012056,800,1,0),//狗狗鼻子1012056		  
Array(1402063,400,1,1),//樱花伞
Array(1302058,900,1,1),//枫叶伞			
Array(1092022,400,1,1),//调色板盾牌							
Array(1302106,900,1,1),//燃烧的冰焰刀
Array(1302080,900,1,0),//冒险岛小灯泡
Array(1302087,900,1,0),//火炬
Array(1382015,900,1,1),//毒蘑菇
Array(1382016,900,1,1),//香菇
Array(1402044,900,1,1),//南瓜灯笼
Array(1302024,900,1,0),//废报纸武器
Array(1322051,900,1,0),//七夕
Array(1402014,400,1,1),//温度计
Array(1442039,900,1,0),//冻冻鱼
Array(1302019,900,1,0),//无名剑
Array(1332021,900,1,0),//乌龙茶
Array(1302128,900,1,0),//火柴	
Array(1302084,900,1,1),//火柴
Array(1402013,900,1,0),//白日剑
Array(1302036,900,1,1),//枫叶小旗
Array(1302049,900,1,0),//光线鞭

Array(3010026,30,1,1), 
Array(3010045,50,1,1), 
Array(3010048,50,1,1),
Array(3010053,30,1,1),
Array(3010068,50,1,1),
Array(3010077,50,1,1),
Array(3010078,30,1,1),
Array(3010079,50,1,1),
Array(3010085,50,1,1),
Array(3010094,30,1,1),
Array(3010099,50,1,1),
Array(3010100,50,1,1),
Array(3010110,50,1,1),
Array(3010113,50,1,1),
Array(3010116,30,1,1),

Array(3010118,50,1,1),
Array(3010119,50,1,1),
Array(3010124,50,1,1),
Array(3010135,50,1,1),
Array(3010137,50,1,1),
Array(3010141,50,1,1),
Array(3010142,10,1,1),
Array(3010144,50,1,1),
Array(3010732,50,1,1),
Array(3010737,50,1,1),
Array(3010146,50,1,1),
Array(3010151,50,1,1),
Array(3010155,50,1,1),

Array(3010157,50,1,1),
Array(3010168,50,1,1),
Array(3010170,50,1,1),
Array(3010172,50,1,1),
Array(3010173,50,1,1),

Array(3010175,50,1,1),
Array(3010180,50,1,1),
Array(3010181,50,1,1),
Array(3010183,50,1,1),

Array(3010184,20,1,1),

Array(3010186,50,1,1),
Array(3010188,50,1,1),
Array(3010189,50,1,1),

Array(3010191,50,1,1),
Array(3010194,50,1,1),
Array(3010195,50,1,1),
Array(3010197,50,1,1),
Array(3010200,50,1,1),
Array(3010201,50,1,1),
Array(3010205,50,1,1),
Array(3010206,50,1,1),
Array(3010207,50,1,1),
Array(3010208,50,1,1),
Array(3010209,50,1,1),
Array(3010210,50,1,1),
Array(3010212,50,1,1),
Array(3010215,50,1,1),
Array(3010216,50,1,1),
Array(3010218,50,1,1),
Array(3010219,50,1,1),
Array(3010279,50,1,1),
Array(3010280,50,1,1),
Array(3010288,50,1,1),
Array(3010289,50,1,1),
Array(3010293,50,1,1),
Array(3010296,50,1,1),
Array(3010298,50,1,1),
Array(3010299,50,1,1),
Array(3010300,50,1,1),
Array(3010301,50,1,1),
Array(3010302,50,1,1),
Array(3010304,50,1,1),
Array(3010306,50,1,1),
Array(3010311,50,1,1),
Array(3010313,50,1,1),

Array(3010321,50,1,1),
Array(3010322,50,1,1),
Array(3010357,50,1,1),
Array(3010360,50,1,1),
Array(3010361,50,1,1),
Array(3010365,50,1,1),
Array(3010368,50,1,1),
Array(3010369,50,1,1),
Array(3010373,50,1,1),
Array(3010406,50,1,1),
Array(3010408,50,1,1),
Array(3010409,50,1,1),
Array(3010411,50,1,1),
Array(3010414,50,1,1),
Array(3010423,50,1,1),
Array(3010428,50,1,1),
Array(3010429,50,1,1),
Array(3010430,50,1,1),
Array(3010431,50,1,1),
Array(3010435,50,1,1),
Array(3010441,50,1,1),
Array(3010447,50,1,1),
Array(3010448,50,1,1),
Array(3010449,50,1,1),
Array(3010450,50,1,1),
Array(3010455,50,1,1),
Array(3010456,50,1,1),
Array(3010460,50,1,1),
Array(3010490,50,1,1),
Array(3010491,50,1,1),
Array(3010492,50,1,1),
Array(3010494,50,1,1),
Array(3010510,50,1,1),

Array(3010511,50,1,1),
Array(3010515,50,1,1),
Array(3010524,50,1,1),
Array(3010526,50,1,1),
Array(3010536,50,1,1),
Array(3010537,50,1,1),
Array(3010545,50,1,1),
Array(3010565,50,1,1),
Array(3010569,50,1,1),
Array(3010570,50,1,1),
Array(3010580,50,1,1),
Array(3010582,50,1,1),
Array(3010585,50,1,1),
Array(3010598,50,1,1),
Array(3010606,50,1,1),
Array(3010608,50,1,1),
Array(3010612,50,1,1),
Array(3010631,50,1,1),
Array(3010636,50,1,1),
Array(3010657,50,1,1),
Array(3010659,50,1,1),
Array(3010660,50,1,1),
Array(3010661,50,1,1),
Array(3010664,50,1,1),
Array(3010690,50,1,1),
Array(3010691,50,1,1),
Array(3010692,50,1,1),
Array(3010693,50,1,1),
Array(3010694,50,1,1),
Array(3010695,50,1,1),
Array(3010705,50,1,1),
Array(3010716,50,1,1),
Array(3010722,50,1,1),
// 未登记

Array(3010836,50,1,1),
Array(3010845,50,1,1),
Array(3010848,50,1,1),
Array(3010849,50,1,1),
Array(3010850,50,1,1),
Array(3010851,50,1,1),
Array(3010853,50,1,1),
Array(3010863,50,1,1),
Array(3010867,50,1,1),
Array(3010868,50,1,1),
Array(3010869,50,1,1),
Array(3010870,50,1,1),
Array(3010871,50,1,1),
Array(3010872,50,1,1),
Array(3010967,50,1,1),
Array(3010966,50,1,1),
Array(3010973,50,1,1),
Array(3010976,50,1,1),
Array(3010983,50,1,1),
Array(3010984,50,1,1),
Array(3010999,50,1,1),
Array(3012016,50,1,1),
Array(3012017,50,1,1),
Array(3012024,50,1,1),
Array(3012030,50,1,1),
Array(3013001,50,1,1),
Array(3014000,50,1,1),
Array(3014001,50,1,1),
Array(3014003,50,1,1),
Array(3014004,50,1,1),
Array(3014008,50,1,1),
Array(3014009,50,1,1),
Array(3015009,50,1,1),

Array(3015046,50,1,1),
Array(3015045,50,1,1),
Array(3015057,50,1,1),
Array(3015059,50,1,1),
Array(3015076,50,1,1),
Array(3015077,50,1,1),
Array(3015078,50,1,1),
Array(3015080,50,1,1),
Array(3015081,50,1,1),
Array(3015084,50,1,1),
Array(3015088,50,1,1),
Array(3015089,50,1,1),
Array(3015091,50,1,1),
Array(3015092,50,1,1),
Array(3015093,50,1,1),
Array(3015098,50,1,1),
Array(3015099,50,1,1),
Array(3015100,50,1,1),
Array(3015195,50,1,1),
Array(3015240,50,1,1),
Array(3015243,50,1,1),
Array(3015245,50,1,1),
Array(3015244,50,1,1),
Array(3015267,50,1,1),
Array(3015269,50,1,1),
Array(3015271,50,1,1),
Array(3015277,50,1,1),
Array(3015279,50,1,1),
Array(3015297,50,1,1),
Array(3015315,50,1,1),
Array(3015303,50,1,1),
Array(3015329,50,1,1),
Array(3015338,50,1,1),

Array(3015372,50,1,1),
Array(3015376,50,1,1),
Array(3015415,50,1,1),
Array(3015419,50,1,1),
Array(3015430,50,1,1),
Array(3015426,50,1,1),
Array(3015439,50,1,1),
Array(3010070,20, 1, 1),  //巨无霸品克缤
Array(3015051,20, 1, 1),  //巨无霸国际巨星
Array(3010025,50, 1, 1),  //枫叶纪念凳
Array(3010044,50, 1, 1),  //同一红伞下
Array(3015482,50,1,1)	
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r该玩具箱可以获得以下物品，99%获得\r\n\r\r\r\r\r\r\r\r\r\r#b是否消耗  #g1#r个#b#v4001126#来一发？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#i" + itemList[i][0] + ":#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#i" + itemList[i][0] + ":#";
            }
        if (cm.haveItem(4001126, 3000)) {
            cm.sendYesNo("只要你有#v4001126#，就可以随机可以获得以下物品，99%获得\r\n\#b是否消耗 #r300#r个#b#v4001126#来1发？?"+selStr);
        } else {
            cm.sendOk("只要你有#v4001126#，就可以随机获得以下物品，99%获得\r\n\#b是否消耗 #r300#r个#b#v4001126#来1发？每次抽奖10连起步\n"+selStr);
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
			for (var i = 0; i < 10; i++) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			
            item = cm.gainGachaponItem(itemId, quantity, "蓝蜗牛区", "恭喜获得道具！");
			
            if (item != -1) {
                cm.gainItem(4001126, -300);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
                //cm.喇叭(1,"玩家.["+ cm.getChar().getName() +"] 用抽奖币进行了一次抽奖,获得稀有物品");
            } else {
                cm.sendOk("你确实有#b#t4001126##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
			}
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：白雪人法老的蓝宝石。)");
            cm.gainItem(4001126, -2);
            cm.gainItem(4001322, 1);
            cm.safeDispose();
        }
    }
}